{
  "dashboard_main": {
    "steps": [
      {
        "title": "مرحباً بك في لوحة تحكم ResuGenie",
        "content": "هذه هي لوحة التحكم الرئيسية حيث يمكنك الوصول إلى جميع الميزات. دعنا نأخذ جولة سريعة لمساعدتك على البدء!"
      },
      {
        "title": "عنصر إكمال الملف الشخصي",
        "content": "يعرض هذا العنصر تقدم إكمال ملفك الشخصي. أكمل ملفك الشخصي لملء سيرتك الذاتية تلقائياً بمعلوماتك."
      },
      {
        "title": "ميزات المنصة",
        "content": "هنا يمكنك الوصول إلى جميع الميزات الرئيسية: بناء السيرة الذاتية، تقييم السيرة الذاتية، مطابق الوظائف، ومولد خطاب التقديم."
      },
      {
        "title": "الإجراءات السريعة",
        "content": "الإجراءات السريعة تساعدك على البدء بسرعة في المهام الأساسية مثل إنشاء سيرة ذاتية جديدة أو إكمال ملفك الشخصي."
      },
      {
        "title": "النشاط الأخير",
        "content": "هنا يمكنك رؤية سيرك الذاتية والتقييمات الأخيرة. يساعدك هذا على تتبع عملك ومتابعة من حيث توقفت."
      }
    ]
  },
  "navbar": {
    "steps": [
      {
        "title": "شريط التنقل",
        "content": "استخدم شريط التنقل للوصول السريع إلى أقسام مختلفة من لوحة التحكم. الصفحة النشطة مميزة."
      },
      {
        "title": "رصيد الرموز",
        "content": "يتم عرض رصيد الرموز الخاص بك هنا. تُستخدم الرموز للميزات المدعومة بالذكاء الاصطناعي مثل تقييم السيرة الذاتية وإنشاء خطاب التقديم."
      },
      {
        "title": "مبدل المظهر",
        "content": "قم بالتبديل بين المظهر الفاتح والداكن لتخصيص تجربتك."
      },
      {
        "title": "قائمة الملف الشخصي",
        "content": "الوصول إلى ملفك الشخصي وإعدادات الحساب وتسجيل الخروج من هنا. يمكنك أيضاً عرض إحصائيات استخدام الرموز الخاصة بك."
      }
    ]
  },
  "my_resumes": {
    "steps": [
      {
        "title": "صفحة سيري الذاتية",
        "content": "هذا هو المكان الذي تدير فيه جميع سيرك الذاتية. يمكنك عرض وتحرير وحذف وتصدير سيرك الذاتية من هنا."
      },
      {
        "title": "إنشاء سيرة ذاتية جديدة",
        "content": "انقر فوق هذا الزر لإنشاء سيرة ذاتية جديدة تماماً من الصفر باستخدام منشئنا الموجه."
      },
      {
        "title": "قائمة السير الذاتية",
        "content": "يتم عرض جميع سيرك الذاتية هنا. يمكنك التبديل بين عرض الشبكة وعرض القائمة، وتصفية أو البحث في سيرك الذاتية."
      },
      {
        "title": "إجراءات السيرة الذاتية",
        "content": "لكل سيرة ذاتية، يمكنك معاينتها وتحريرها وتصديرها كملف PDF وإعادة تسميتها أو حذفها باستخدام قائمة الإجراءات."
      }
    ]
  },
  "job_matcher": {
    "steps": [
      {
        "title": "مطابق الوظائف",
        "content": "طابق سيرتك الذاتية مع إعلانات الوظائف لمعرفة مدى ملاءمتك. احصل على درجات المطابقة المدعومة بالذكاء الاصطناعي واقتراحات التحسين."
      },
      {
        "title": "اختر السيرة الذاتية",
        "content": "اختر السيرة الذاتية التي تريد مطابقتها مع إعلانات الوظائف. يمكنك الاختيار من سيرك الذاتية المحفوظة."
      },
      {
        "title": "تفاصيل الوظيفة",
        "content": "أدخل عنوان الوظيفة ووصف الوظيفة الكامل هنا. كلما زادت التفاصيل التي تقدمها، كان تحليل المطابقة أفضل."
      },
      {
        "title": "طابق الآن",
        "content": "انقر فوق هذا الزر لتحليل مدى مطابقة سيرتك الذاتية لإعلان الوظيفة. ستحصل على درجة مطابقة مفصلة وتوصيات."
      },
      {
        "title": "نتائج المطابقة",
        "content": "عرض درجة المطابقة الخاصة بك، نقاط القوة، نقاط الضعف، والاقتراحات المولدة بالذكاء الاصطناعي لتحسين سيرتك الذاتية لهذه الوظيفة المحددة."
      },
      {
        "title": "سجل المطابقة",
        "content": "شاهد جميع مطابقات الوظائف السابقة هنا. يمكنك مراجعة التحليلات السابقة وتتبع تحسينك بمرور الوقت."
      }
    ]
  },
  "cover_letter": {
    "steps": [
      {
        "title": "مولد خطاب التقديم",
        "content": "قم بإنشاء خطابات تقديم احترافية ومخصصة لطلبات الوظائف المحددة باستخدام الذكاء الاصطناعي. ستكون خطاباتك مخصصة بناءً على سيرتك الذاتية ووصف الوظيفة."
      },
      {
        "title": "اختر السيرة الذاتية",
        "content": "اختر السيرة الذاتية التي تريد استخدامها كأساس لخطاب التقديم الخاص بك. سيشير خطاب التقديم إلى خبرتك ومهاراتك من هذه السيرة الذاتية."
      },
      {
        "title": "معلومات الوظيفة",
        "content": "أدخل عنوان الوظيفة واسم الشركة ووصف الوظيفة واسم مدير التوظيف (اختياري) لتخصيص خطاب التقديم الخاص بك."
      },
      {
        "title": "اختيار النبرة",
        "content": "اختر النبرة لخطاب التقديم الخاص بك: احترافي، ودود، أو رسمي. كل نبرة تخلق أسلوباً مختلفاً من التواصل."
      },
      {
        "title": "إنشاء خطاب التقديم",
        "content": "انقر فوق هذا الزر لإنشاء خطاب التقديم المخصص الخاص بك. سيقوم الذكاء الاصطناعي بإنشاء خطاب مخصص بناءً على سيرتك الذاتية وتفاصيل الوظيفة."
      },
      {
        "title": "خطاب التقديم المولد",
        "content": "يظهر خطاب التقديم المولد بالذكاء الاصطناعي هنا. يمكنك نسخه أو تنزيله أو إعادة توليده بإعدادات مختلفة."
      },
      {
        "title": "سجل خطابات التقديم",
        "content": "عرض جميع خطابات التقديم المولدة مسبقاً هنا. يمكنك الوصول إلى أي خطاب تقديم سابق أو نسخه أو إعادة توليده."
      }
    ]
  },
  "evaluator": {
    "steps": [
      {
        "title": "مقيّم السيرة الذاتية",
        "content": "احصل على ملاحظات واقتراحات مدعومة بالذكاء الاصطناعي لتحسين سيرتك الذاتية. يحلل المقيّم سيرتك الذاتية ويقدم توصيات قابلة للتنفيذ."
      },
      {
        "title": "اختر السيرة الذاتية أو الملف الشخصي",
        "content": "اختر السيرة الذاتية المراد تقييمها، أو اختر 'الملف الشخصي الحالي' لتقييم بيانات حسابك. يحدد هذا ما سيتم تحليله."
      },
      {
        "title": "زر التقييم",
        "content": "انقر فوق هذا الزر لبدء التقييم. سيقوم الذكاء الاصطناعي بتحليل سيرتك الذاتية وتقديم درجة شاملة مع ملاحظات مفصلة."
      },
      {
        "title": "الدرجة الإجمالية",
        "content": "يتم عرض درجتك الإجمالية للسيرة الذاتية من 10 هنا. يعطيك هذا نظرة عامة سريعة على جودة سيرتك الذاتية."
      },
      {
        "title": "حالة التقييم",
        "content": "تظهر الحالة ما إذا كانت سيرتك الذاتية ممتازة أو جيدة أو تحتاج إلى تحسين بناءً على تحليل الذكاء الاصطناعي."
      },
      {
        "title": "المشاكل والتوصيات",
        "content": "المشاكل التفصيلية الموجودة في سيرتك الذاتية مدرجة هنا مع مستويات الأولوية. تتضمن كل مشكلة توصيات محددة للتحسين."
      },
      {
        "title": "الاقتراحات العامة",
        "content": "اقتراحات مولدة بالذكاء الاصطناعي لتحسين سيرتك الذاتية بشكل عام. هذه نصائح قابلة للتنفيذ لتعزيز فعالية سيرتك الذاتية."
      }
    ]
  }
}




